Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: When we started the project, none of the existing DID methods met all of these criteria. Therefore, we chose to support both the existing [did-web](https://w3c-ccg.github.io/did-method-web/) method (which is simple), and a novel method we created called [DID PLC](https://github.com/bluesky-social/did-method-plc).
ja: プロジェクト開始時点で、DIDメソッドのいずれも当社の基準を完全には満たしていませんでした。そのため、私たちは[did-web](https://w3c-ccg.github.io/did-method-web/)と、私たちが作成した[DID PLC](https://github.com/bluesky-social/did-method-plc)という新規メソッドをサポートすることを選択しました。

source: When you sign up for a new account using an Atmosphere app, that app will communicate with a PDS to register a new handle for you, using its domain name (for example, `*.bsky.social`).
ja: Atmosphereアプリを使用して新しいアカウントを登録すると、そのアプリはPDSと通信し、PDS管理下のドメイン名（例：`*.bsky.social`）を使用して新しいハンドルを登録します。

source: When you tap on a check, you’ll see which organizations have granted verification.
ja: チェックをタップすると、どの組織が認証を与えているかが表示されます。

source: When you update your app to use new permission sets, it's important to coordinate the software release with the permission-set updates. If you add new permission sets that require user approval, users will need to re-authorize your app to grant these new permissions.
ja: アプリを新しい権限セットに対応させる際は、ソフトウェアのリリースと権限セットの更新を同期させることが重要です。ユーザーの承認が必要な新しい権限セットを追加すると、ユーザーは新しい権限を付与するためにアプリを再認可する必要があります。

source: When your app initiates an OAuth flow with an ATProto identity provider, it can request specific permission sets by including them in the `scope` parameter of the authorization request. This should be supplied as a *space-separated list* in the [`oauth-client-metadata.json` file](/specs/oauth#clients) when registering your OAuth client:
ja: アプリがATプロトコルのIDプロバイダーでOAuthフローを開始する際、認可リクエストの`scope`パラメーターに含めることで特定の権限セットを要求できます。これはOAuthクライアント登録時に[`oauth-client-metadata.json`ファイル](/specs/oauth#clients)へ*スペース区切りのリスト*として指定します。

source: When your app initiates an OAuth flow with an Atproto identity provider, it can request specific permission sets by including them in the `scope` parameter of the authorization request. This should be supplied as a *space-separated list* in the [`oauth-client-metadata.json` file](/specs/oauth#clients) when registering your OAuth client:
ja: アプリがatprotoのIDプロバイダーでOAuthフローを開始する際、認可リクエストの`scope`パラメーターに含めることで特定の権限セットを要求できます。これはOAuthクライアント登録時に[`oauth-client-metadata.json`ファイル](/specs/oauth#clients)へ*スペース区切りのリスト*として指定します。

source: Which languages would you like to see in your algorithmic feeds?
ja: アルゴリズムによるフィードにはどの言語を使用しますか？

source: Which we then resolve:
ja: これを解決すると以下のようになります。

source: While blobs are universally content addressed (by CID), they are always referenced and managed in the context of an individual account (DID).
ja: blobは（CIDによって）ユニバーサルにコンテンツアドレス指定されていますが、常に個別のアカウント（DID）のコンテキストで参照および管理されます。

source: While peer-to-peer technology was being explored, the platforms that make up the modern web continued to grow in size. As the barriers to participating in the web lowered, millions and eventually billions of people started participating in and generating content on the web.
ja: P2P技術が探求される一方で、現代のウェブを構成するプラットフォームは規模を拡大し続けました。ウェブ参加の障壁が下がるにつれ、数百万、やがては数十億の人々がウェブに参加し、コンテンツを生成するようになりました。

source: While the Web exchanges documents, the AT Protocol exchanges schematic and semantic information, enabling the software from different organizations to understand each others' data. This gives atproto clients freedom to produce user interfaces independently of the servers, and removes the need to exchange rendering code (HTML/JS/CSS) while browsing content.
ja: ウェブがドキュメントを交換する一方で、ATプロトコルはスキーマ情報とセマンティック情報を交換し、異なる組織のソフトウェアが互いのデータを理解できるようにします。これにより、atprotoクライアントはサーバーから独立してユーザーインターフェイスを自由に作成でき、コンテンツを閲覧する際にレンダリングコード（HTML/JS/CSS）を交換する必要がなくなります。

source: While there is a canonical host for every identity, the data that comes out of that host is self-certifying and self-describing. This means that it can be arbitrarily rebroadcast out into the network. Consumers of user data do not ever need to reach out to the canonical host of the data. Instead, they can rely on external services that crawl the canonical data hosts and output a stream of updates for some well-defined set of the network.
ja: 各IDには1つ正規のホストがありますが、そこから出てくるデータは自己証明的で自己記述的です。つまり、ネットワークに向けて任意に再配信できます。ユーザーデータの利用者は、その正規ホストに直接アクセスする必要はありません。代わりに、正規データホストをクロールしてネットワークの特定範囲に対するストリームを出力する外部サービスを利用できます。

source: While there's something empowering about the idea of being able to do *anything*, it's also easy for this to fall into the tyranny of structurelessness - a collapse in coordination that prevents anything from actually getting done. Without structure in the network, energy that could go into novel development gets redirected into facilitating interoperation, fixing edgecases between implementations, building up defenses to bad actors or security issues from other parties, and trying to coordinate evolution without a clear leader.
ja: *何でもできる*という考えには力強さがありますが、同時に構造なき専制へ陥りやすく、結果として調整が崩壊し、何も進まなくなります。ネットワークに構造がなければ、新しい開発に注げるはずのエネルギーは、相互運用の調整、実装間のエッジケース修正、悪意ある参加者や他者由来のセキュリティ問題への防御、明確なリーダー不在での進化の調整へと振り向けられてしまいます。

source: While this openness is the defining governance feature of the web, the defining product feature is the hyperlink. A hyperlink is a link in a document that navigates you to another document. Notably, these hyperlinks can link *across authorities* without permission of the other authority. The result of this is that the web is not just a collection of unrelated documents published in isolation. Rather, documents on the web form a vast integrated network of interconnected data.
ja: この開放性がウェブのガバナンス上の決定的特徴である一方、プロダクト上の決定的特徴はハイパーリンクです。ハイパーリンクは文書内のリンクで、別の文書へ導きます。特筆すべき点は、これらのリンクが相手の権威の許可なしに*権威をまたいで*リンクできることです。その結果、ウェブは孤立して公開された無関係な文書の集合ではなく、相互に接続されたデータの巨大な統合ネットワークになります。

source: While we're at it, let's create a [whole URL scheme](/specs/at-uri-scheme) for our records too.
ja: ついでに、レコード用の[URLスキーム全体](/specs/at-uri-scheme)も作成しましょう。

source: While you are doing that, buffer any events for the repo to go through after the checkpoint has been processed.
ja: その間、チェックポイント以降に通過するリポジトリイベントをバッファします。

source: Who can interact with this post?
ja: 誰がこの投稿に反応できますか？

source: Who can reply
ja: 返信できるユーザー

source: Who can verify?
ja: 誰が認証できますか？

source: Whoops!
ja: おっと！

source: Whoops! Trending videos failed to load.
ja: おっと！トレンドビデオの読み込みに失敗しました。

source: Why are we listening to the event stream if we're the one making the write? Because we're not the only ones making writes! There are lots of user repos generating events, and lots of apps writing to them!
ja: 書き込みを行っているのに、なぜイベントストリームをリッスンしているのでしょうか。書き込みを行っているのは私たちだけではないからです。イベントを生成するユーザーリポジトリは多数あり、それらに書き込むアプリも多数あります。

source: Why are you appealing?
ja: なぜ異議申し立てをするのですか？

source: Why don't we learn something about our user? In [Bluesky](https://bsky.app), users publish a "profile" record which looks like this:
ja: ユーザーについて何か調べてみましょう。[Bluesky](https://bsky.app)では、ユーザーは次のようなプロフィールレコードを公開します。

source: Why should this conversation be reviewed?
ja: なぜこの会話をレビューする必要がありますか？

source: Why should this feed be reviewed?
ja: なぜこのフィードをレビューする必要がありますか？

source: Why should this list be reviewed?
ja: なぜこのリストをレビューする必要がありますか？

source: Why should this message be reviewed?
ja: なぜこのメッセージをレビューする必要がありますか？

source: Why should this post be reviewed?
ja: なぜこの投稿をレビューする必要がありますか？

source: Why should this starter pack be reviewed?
ja: なぜこのスターターパックをレビューする必要がありますか？

source: Why should this user be reviewed?
ja: なぜこのユーザーをレビューする必要がありますか？

source: Why sync from the event log like this? Because there are other apps in the network that will write the records we're interested in. By subscribing to the event log, we ensure that we catch all the data we're interested in &mdash; including data published by other apps!
ja: このようにイベントログから同期する理由は、ネットワーク内に、対象のレコードを書き込む他のアプリがあるためです。イベントログをサブスクライブすることで、他のアプリによって公開されたデータを含む、すべてのデータをキャッチできます。

source: Wildcards (*) are allowed in scope string syntax, and grants access to all records — the most common example being `blob:*/*`, for working with images and video. Partial wildcards are *not* supported — for example, `app.bsky.*` is not a valid scope string. If you wanted to request multiple permissions from a particular namespace or Lexicon, you would need to list them out individually, or use a [permission set](#for-lexicon-designers). This is intentional, to avoid overbroad permission requests.
ja: スコープ文字列の構文ではワイルドカード（\*）が許可され、すべてのレコードへのアクセスが付与されます。最も一般的な例は、画像や動画の取り扱い向けの`blob:*/*`です。部分的なワイルドカードはサポート*されません*。例えば、`app.bsky.*`は有効なスコープ文字列ではありません。特定の名前空間やLexiconから複数の権限を要求したい場合は、個別に列挙するか、[権限セット](#for-lexicon-designers)を使用する必要があります。これは過剰に広い権限要求を避けるための意図的な設計です。

source: With each step we'll explain how our Web app taps into the Atmosphere. Refer to the codebase for more detailed code &mdash; again, this tutorial is going to keep it light and quick to digest.
ja: 各ステップで、ウェブアプリがAtmosphereを活用する方法を説明します。詳細なコードについては、コードベースを参照してください。繰り返しますが、このチュートリアルでは、わかりやすく簡潔に説明します。

source: With that data, we can give a nice personalized welcome banner for our user:
ja: このデータを使用して、ユーザー向けにパーソナライズされた素敵なウェルカムバナーを表示できます。

source: With that, we're in business! We now have a session with the user's repo server and can use that to access their data.
ja: さあ、準備ができました。これで、ユーザーのリポジトリサーバーとのセッションが確立され、それを使用してユーザーのデータにアクセスできます。

source: With the identity successfully updated, the new PDS is now the "current" host for the account from the perspective of the entire network. This will be immediately apparent to new services which resolve the identity. Existing services that consume from the firehose will be alerted by the `#identity` event. Other services, which may have now-stale cached identity metadata for the account, will either refresh when the cache expires, or should refresh their cache when they encounter errors (such as invalid service auth signatures).
ja: IDが正常に更新されると、新PDSはネットワーク全体でそのアカウントの現行ホストになります。これは新規サービスのID解決には即座に反映されます。firehoseを消費している既存サービスには`#identity`イベントで通知されます。古いIDメタデータのキャッシュを持つサービスは、キャッシュの期限切れ時に更新するか、署名失敗などのエラーに遭遇した際にキャッシュを更新します。

source: With this, atproto avoids the gray area of “we're sort of talking about the same thing but not really” and forces applications into the discrete choice that if you're talking about the same thing then you're talking about the *exact* same thing. Instead of trying to posit universality of semantics, atproto facilitates specific semantics and then allows for collaboration and extension of those semantics.
ja: これにより、atprotoは「だいたい同じことを話しているけれど実は違う」というグレーゾーンを避け、同じことを話すなら*まったく*同じことを話すという離散的な選択をアプリケーションに強います。意味の普遍性を仮定しようとするのではなく、atprotoは特定の意味を促進し、その意味の協調と拡張を可能にします。

source: With this, p2p moved away from the traditional location-based authority model of the web and towards “self-certifying data”. Data could come from a device that didn't originally create that data, and even if the content is coming from the canonical device, that device probably doesn't have a static IP associated with the account. Therefore p2p protocols moved the authority of data from the location of the data to the data itself.
ja: これにより、P2Pはウェブの伝統的な場所ベースの権威モデルから離れ、自己証明データへと向かいました。データは元の作成者ではないデバイスから届く可能性があり、たとえ正規のデバイスから来ていても、そのデバイスはアカウントに紐付いた固定IPを持たないことが多いのです。結果として、P2Pプロトコルはデータの権威をデータの置場からデータそのものへ移しました。

source: Would you like to block this user and/or delete this conversation?
ja: ユーザーをブロックするかこの会話を削除しますか（あるいは両方）？

source: Write a message
ja: メッセージを書く

source: Write a post
ja: 投稿を書く

source: Write post
ja: 投稿を書く

source: Write your reply
ja: 返信を書く

source: Writers
ja: ライター

source: Writing data — for example, by posting to a Bluesky feed — works similarly to [reading data](/guides/reading-data), but with different methods.
ja: Blueskyフィードに投稿するなどのデータ書き込みは、[読み取り](/guides/reading-data)に似ていますが、少しやり方が変わります。

source: Wrong DID returned from server. Received: {0}
ja: サーバーから間違ったDIDが送られてきました。受信したもの：{0}

source: XRPC is [atproto's](#at-protocol) HTTP API. It stands for "Cross-organizational Remote Procedure Calls" and is a thin wrapper around standard HTTPS. XRPC uses [Lexicon](#lexicon) schemas to define the valid parameters and responses for each API endpoint.
ja: XRPCは非推奨の用語ですが、歴史的には[atproto](#at-protocol)のHTTP用法を説明するために使用されていました。これは「Cross-organizational Remote Procedure Calls」の略語ですが、実際にはHTTPを使用しているだけなので、この用語を発明したことを後悔しています。

source: XRPC uses [Lexicon](/guides/lexicon) to describe HTTP calls and maps them to `/xrpc/{methodId}`. For example, this API call:
ja: XRPCは[Lexicon](/guides/lexicon)を使用してHTTP呼び出しを記述し、それらを`/xrpc/{methodId}`にマッピングします。たとえば、次のAPI呼び出し：

source: XRPC uses [Lexicons](/guides/lexicon) to describe HTTP calls and maps them to `/xrpc/{methodId}`. For example, this API call:
ja: XRPCは[Lexicon](/guides/lexicon)を使用してHTTP呼び出しを記述し、それらを`/xrpc/{methodId}`にマッピングします。たとえば、次のようなAPI呼び出しを考えます。

source: Yes
ja: はい

source: Yes, deactivate
ja: はい、無効化します

source: Yes, delete this starter pack
ja: はい、このスターターパックを削除します

source: Yes, detach
ja: はい、切り離します

source: Yes, hide
ja: はい、非表示にします

source: Yes, reactivate my account
ja: はい、アカウントを再有効化します

source: Yesterday
ja: 昨日

source: You are Live
ja: ライブ中

source: You are a trusted verifier
ja: あなたは信頼された認証者です

source: You are accessing Bluesky from a region that legally requires us to verify your age before allowing you to access the app.
ja: お客様は、アプリにアクセスする前に年齢を確認することを法的に要求する地域からBlueskyにアクセスしています。

source: You are creating an account on
ja: アカウントを作成するホスティングプロバイダー：

source: You are currently unable to access Bluesky's Age Assurance flow. Please <0>contact our moderation team</0> if you believe this is an error.
ja: 現在Blueskyの年齢保証手順にアクセスできません。これがエラーだと思われる場合は<0>モデレーションチーム</0>までご連絡ください。

source: You are in line.
ja: あなたは並んでいます。

source: You are no longer live
ja: もうライブ中ではありません

source: You are not allowed to go live
ja: ライブの設定は許可されていません

source: You are not allowed to upload videos.
ja: あなたはビデオのアップロードを許可されていません。

source: You are not following anyone yet
ja: まだ誰もフォローしていません

source: You are now live!
ja: 現在ライブ中です！

source: You are verified
ja: あなたは認証されています

source: You are verified. You will lose your verification status if you change your display name. <0>Learn more.</0>
ja: あなたは認証されています。表示名を変更すると、認証ステータスが失われます。<0>詳細はこちら。</0>

source: You are verified. You will lose your verification status if you change your handle. <0>Learn more.</0>
ja: あなたは認証されています。ハンドルを変更すると、認証ステータスが失われます。<0>詳細はこちら。</0>

source: You can [host your own PDS](/guides/self-hosting), and [migrate individual accounts](/guides/account-migration) from one PDS to another. Refer to [The AT Stack](/guides/the-at-stack#pds) for more information.
ja: [自分のPDSをホスト](/guides/self-hosting)したり、あるPDSから別のPDSに[アカウントを移行](/guides/account-migration)したりできます。詳細については[ATスタック](/guides/the-at-stack#pds)を参照してください。

source: You can [host your own PDS](/guides/self-hosting).
ja: [自分のPDSをホスト](/guides/self-hosting)できます。

source: You can adjust your interests at any time from "Content and media" settings.
ja: 「気になること」は「コンテンツとメディアの設定」でいつでも変更できます。

source: You can almost think of information flowing in a loop:
ja: ほぼ、情報がループで流れていると考えることができます。

source: You can also add labelers using the TypeScript SDK:
ja: TypeScript SDKを使用してラベラーを追加することもできます。

source: You can also create a new Lexicon record with `goat lex new record`:
ja: `goat lex new record`を使って新しいLexiconレコードを作成できます。

source: You can also deploy [Osprey](/guides/moderation#algorithmic-moderation), a rules engine that works with Ozone to automatically create reports that match certain criteria.
ja: また、Ozoneと連携して特定の基準に一致する報告を自動的に作成するルールエンジンである、[Osprey](/guides/moderation#algorithmic-moderation)をデプロイすることもできます。

source: You can also discover new Custom Feeds to follow.
ja: また、あなたはフォローすべき新しいカスタムフィードを発見できます。

source: You can also temporarily deactivate your account instead, and reactivate it at any time.
ja: 代わりにアカウントを一時的に無効化して、いつでも再有効化することもできます。

source: You can always opt out and delete your data
ja: いつでもオプトアウトしてデータを削除することができます

source: You can choose whether chat notifications have sound in the chat settings within the app
ja: アプリ内のチャット設定でチャット通知の音の有無を選択できます

source: You can click through on the **?** icons to see the details of each permission set:
ja: 「**?**」アイコンをクリックすると、各権限セットの詳細を確認できます。

source: You can continue ongoing conversations regardless of which setting you choose.
ja: どの設定を選択しても進行中の会話は続けることができます。

source: You can create a new Lexicon record with `goat lex new record`:
ja: `goat lex new record`を使って新しいLexiconレコードを作成できます。

source: You can examine this record directly using [atproto-browser.vercel.app](https://atproto-browser.vercel.app). For instance, [this is the profile record for @bsky.app](https://atproto-browser.vercel.app/at?u=at://did:plc:z72i7hdynmk6r22z27h6tvur/app.bsky.actor.profile/self).
ja: [atproto-browser.vercel.app](https://atproto-browser.vercel.app)を使用して、このレコードを直接調べることができます。たとえば、[これは@bsky.appのプロフィールレコードです](https://atproto-browser.vercel.app/at?u=at://did:plc:z72i7hdynmk6r22z27h6tvur/app.bsky.actor.profile/self)。

source: You can find a well-documented example of other App View and Relay implementations in [The Blacksky Architecture](https://blackskyweb.xyz/overview/#blacksky-architecture). Different Atmosphere applications may make different implementation choices.
ja: 他のAppViewとリレー実装のよく文書化された例は、[The Blacksky Architecture](https://blackskyweb.xyz/overview/#blacksky-architecture)で見つけられます。各Atmosphereアプリケーションによって実装上の判断が異なる場合があります。

source: You can find more guides and tutorials in our [Guides](/guides) section, and more example apps in the [Cookbook](https://github.com/bluesky-social/cookbook/) repository. Happy building!
ja: さらに多くのガイドやチュートリアルは[Guides](/guides)セクションで、より多くのサンプルアプリは[Cookbook](https://github.com/bluesky-social/cookbook/)リポジトリで確認できます。ぜひ開発を楽しんでください。

source: You can find other examples of community-created feeds at <a href="bsky.app/feeds" target="_blank">https://bsky.app/feeds</a>.
ja: コミュニティが作成したその他のフィード例は<a href="bsky.app/feeds" target="_blank">https://bsky.app/feeds</a>で見つけることができます。

source: You can find the source code for this tutorial, along with other example projects, in the [Cookbook](https://github.com/bluesky-social/cookbook/) repository, under `nextjs-oauth`.
ja: このチュートリアルのソースコードは、他のサンプルプロジェクトとあわせて[Cookbook](https://github.com/bluesky-social/cookbook/)リポジトリの`nextjs-oauth`にあります。

source: You can find the source code for this tutorial, along with other example projects, in the [Cookbook](https://github.com/bluesky-social/cookbook/) repository, under `statusphere`.
ja: このチュートリアルのソースコードは、他のサンプルプロジェクトとあわせて[Cookbook](https://github.com/bluesky-social/cookbook/)リポジトリの`statusphere`にあります。

source: You can hide a maximum of {MAX_HIDDEN_REPLIES} replies.
ja: 最大で{MAX_HIDDEN_REPLIES}件の返信を非表示にできます。

source: You can make API calls to any Lexicon using the same SDK client pattern. For more examples, refer to [the Go SDK libraries](https://pkg.go.dev/github.com/bluesky-social/indigo). </TabPanel> </TabPanels> </TabGroup>
ja: 同様のSDKクライアントパターンを使用して、任意のLexiconにAPI呼び出しを行うことができます。その他の例については、[Go SDKライブラリ](https://pkg.go.dev/github.com/bluesky-social/indigo)を参照してください。 </TabPanel> </TabPanels> </TabGroup>

source: You can make API calls to any Lexicon using the same SDK client pattern. For more examples, refer to [the SDK documentation](https://www.npmjs.com/package/@atproto/lex).
ja: 同様のSDKクライアントパターンを使用して、任意のLexiconにAPI呼び出しを行うことができます。その他の例については、[SDKドキュメント](https://www.npmjs.com/package/@atproto/lex)を参照してください。

source: You can make API calls to any Lexicon using the same SDK client pattern. For more examples, refer to [the SDK documentation](https://www.npmjs.com/package/@atproto/lex). </TabPanel> <TabPanel value="go"> ```go import ( "context" appbsky "github.com/bluesky-social/indigo/api/bsky" "github.com/bluesky-social/indigo/xrpc" )
ja: 同様のSDKクライアントパターンを使用して、任意のLexiconにAPI呼び出しを行うことができます。その他の例については、[SDKドキュメント](https://www.npmjs.com/package/@atproto/lex)を参照してください。 </TabPanel> <TabPanel value="go"> ```go import ( "context" appbsky "github.com/bluesky-social/indigo/api/bsky" "github.com/bluesky-social/indigo/xrpc" )

source: You can migrate an individual account's data repository freely from one PDS to another. This involves the import and export of repositories as CAR files. There are some community tools that make this easier:
ja: 個々のアカウントのデータリポジトリは、PDS間を自由に移行できます。これには、リポジトリをCARファイルとしてインポート/エクスポートすることが含まれます。これを容易にするコミュニティツールがいくつかあります。

source: You can now choose to be notified when specific people post. If there’s someone you want timely updates from, go to their profile and find the new bell icon near the follow button.
ja: 特定のユーザーが投稿した時に通知を受け取ることができるようになります。更新情報をタイムリーに受け取りたい人がいたら、その人のプロフィールのページに移動し、フォローボタンの近くのベルのアイコンを探してください。

source: You can now sign in with your new password.
ja: 新しいパスワードでサインインできるようになりました。

source: You can only select one GIF at a time.
ja: 一度に1つのGIFしか選択できません。

source: You can only select one video at a time.
ja: 一度に1つのビデオしか選択できません。

source: You can provide these as part of our Railway [deployment guide](https://github.com/bluesky-social/nextjs-oauth-tutorial/blob/main/RAILWAY_DEPLOY.md). Follow those steps, and this app should then work from a public URL just like our [demo instance](https://nextjs-oauth-tutorial.up.railway.app/).
ja: これらはRailwayの[デプロイガイド](https://github.com/bluesky-social/nextjs-oauth-tutorial/blob/main/RAILWAY_DEPLOY.md)に沿って設定できます。手順どおり進めれば、このアプリは[デモインスタンス](https://nextjs-oauth-tutorial.up.railway.app/)と同様に公開URLで動作するはずです。

source: You can reactivate your account to continue logging in. Your profile and posts will be visible to other users.
ja: アカウントを再有効化してログインし続けることができます。あなたのプロフィールと投稿は他のユーザーに見えるようになります。

source: You can read posts from a user's data repository with `client.list()`:
ja: `client.list()`を使用してユーザーのデータリポジトリから投稿を読み出すことができます。

source: You can resolve a known username to a DID using the `com.atproto.identity.resolveHandle` endpoint. This means that you can just visit this address in a browser with a `handle=` arugment to look up your DID:
ja: `com.atproto.identity.resolveHandle`エンドポイントを使用して、既知のユーザー名をDIDに解決できます。これは、ブラウザで`handle=`引数を使用してこのアドレスにアクセスしてDIDを調べられることを意味します。

source: You can review the event stream of reports and actions in the *Events* section:
ja: *Events*セクションで報告とアクションのイベントストリームを確認できます。

source: You can run `pnpm migrate` to apply these new migrations to your database. Now, to actually build the app logic!
ja: `pnpm migrate`を実行して新しいmigrationをデータベースに適用できます。続いて、実際のアプリロジックを作っていきます。

source: You can run this bot on your own machine, or deploy it on a platform like [Fly.io](http://fly.io/).
ja: このボットは手元のマシンで実行することも、[Fly.io](http://fly.io/) のようなプラットフォームにデプロイすることもできます。

source: You can select up to {MAX_IMAGES, plural, other {# images}} in total.
ja: 合計で{MAX_IMAGES, plural, other {#枚の画像}}まで選択できます。

source: You can stop and restart your app with `pnpm dev` again.
ja: `pnpm dev`でアプリを停止・再起動できます。

source: You can think of the user repositories as collections of JSON records:
ja: ユーザーリポジトリは、JSONレコードのコレクションと考えることができます。

source: You can update this later from your settings.
ja: これは設定画面から後で変更できます。

source: You can use [`goat`](https://github.com/bluesky-social/goat) to create and publish Lexicons. Before publishing, `goat` can also be used to lint and validate your Lexicon. For example, pulling and linting `app.bsky.feed.post`:
ja: [`goat`](https://github.com/bluesky-social/goat)を使ってLexiconを作成・公開できます。公開前に`goat`でLexiconのリントとバリデーションも行えます。例えば、`app.bsky.feed.post`の取得とリントは以下のように行えます。

source: You can use [`goat`](https://github.com/bluesky-social/goat), our command line tool, for creating and publishing Lexicons. The Lexicon-related features are available under [`goat lex`](https://github.com/bluesky-social/goat?tab=readme-ov-file#lexicon-development) :
ja: コマンドラインツール[`goat`](https://github.com/bluesky-social/goat)を使って、Lexiconを作成・公開できます。Lexicon関連の機能は[`goat lex`](https://github.com/bluesky-social/goat?tab=readme-ov-file#lexicon-development)にあります。
